//
//  imagesData.swift
//  chatApp
//
//  Created by Yabuki Shodai on 2021/06/30.
//

import Foundation

struct imagesData {
    //隠しコマンド的なuserアイコン
    let hiddenImage:[(key: String, imagename: String)] = [
        ("右手に宿いし悪魔よ今力をとき放て","中二病女性")
        ,("右手の封印を解く時が来たようだ","中二病男性")
        ,("働いたら負けだと思ってる男性","ニート男性")
        ,("働いたら負けだと思ってる女性","ニート女性")
        ,("一人は怖い","一人は怖い")
        ,("変態が落とした眼鏡","変態が落とした眼鏡")
        ,("pienm","ピエン男性")
        ,("pienw","ピエン女性")
        ,("来世は神志望","天使")
        ,("不可能の文字","ナポレオン")
        ,("平安女性貴族","平安女性貴族")
        ,("平安男性貴族","平安男性貴族")
        ,("小野小町","小野小町")
        ,("楊貴妃","楊貴妃")
        ,("ホトトギスの変","織田信長")
        ,("謎のパーティーに参加している男性","男性仮面")
        ,("謎のパーティーに参加している女性","女性仮面")
    ]
    
    //usernameのngワードも作る?
    
}
